HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI27 */
#define IFX_PSI5_CRCISET_CRCI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI28 */
#define IFX_PSI5_CRCISET_CRCI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI28 */
#define IFX_PSI5_CRCISET_CRCI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI28 */
#define IFX_PSI5_CRCISET_CRCI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI29 */
#define IFX_PSI5_CRCISET_CRCI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI29 */
#define IFX_PSI5_CRCISET_CRCI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI29 */
#define IFX_PSI5_CRCISET_CRCI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI2 */
#define IFX_PSI5_CRCISET_CRCI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI2 */
#define IFX_PSI5_CRCISET_CRCI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI2 */
#define IFX_PSI5_CRCISET_CRCI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI30 */
#define IFX_PSI5_CRCISET_CRCI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI30 */
#define IFX_PSI5_CRCISET_CRCI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI30 */
#define IFX_PSI5_CRCISET_CRCI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI31 */
#define IFX_PSI5_CRCISET_CRCI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI31 */
#define IFX_PSI5_CRCISET_CRCI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI31 */
#define IFX_PSI5_CRCISET_CRCI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI3 */
#define IFX_PSI5_CRCISET_CRCI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI3 */
#define IFX_PSI5_CRCISET_CRCI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI3 */
#define IFX_PSI5_CRCISET_CRCI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI4 */
#define IFX_PSI5_CRCISET_CRCI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI4 */
#define IFX_PSI5_CRCISET_CRCI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI4 */
#define IFX_PSI5_CRCISET_CRCI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI5 */
#define IFX_PSI5_CRCISET_CRCI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI5 */
#define IFX_PSI5_CRCISET_CRCI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI5 */
#define IFX_PSI5_CRCISET_CRCI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI6 */
#define IFX_PSI5_CRCISET_CRCI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI6 */
#define IFX_PSI5_CRCISET_CRCI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI6 */
#define IFX_PSI5_CRCISET_CRCI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI7 */
#define IFX_PSI5_CRCISET_CRCI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI7 */
#define IFX_PSI5_CRCISET_CRCI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI7 */
#define IFX_PSI5_CRCISET_CRCI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI8 */
#define IFX_PSI5_CRCISET_CRCI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI8 */
#define IFX_PSI5_CRCISET_CRCI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI8 */
#define IFX_PSI5_CRCISET_CRCI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_CRCISET_Bits.CRCI9 */
#define IFX_PSI5_CRCISET_CRCI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_CRCISET_Bits.CRCI9 */
#define IFX_PSI5_CRCISET_CRCI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_CRCISET_Bits.CRCI9 */
#define IFX_PSI5_CRCISET_CRCI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_FDR_Bits.DM */
#define IFX_PSI5_FDR_DM_LEN (2)

/** \\brief  Mask for Ifx_PSI5_FDR_Bits.DM */
#define IFX_PSI5_FDR_DM_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5_FDR_Bits.DM */
#define IFX_PSI5_FDR_DM_OFF (14)

/** \\brief  Length for Ifx_PSI5_FDR_Bits.RESULT */
#define IFX_PSI5_FDR_RESULT_LEN (10)

/** \\brief  Mask for Ifx_PSI5_FDR_Bits.RESULT */
#define IFX_PSI5_FDR_RESULT_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5_FDR_Bits.RESULT */
#define IFX_PSI5_FDR_RESULT_OFF (16)

/** \\brief  Length for Ifx_PSI5_FDR_Bits.STEP */
#define IFX_PSI5_FDR_STEP_LEN (10)

/** \\brief  Mask for Ifx_PSI5_FDR_Bits.STEP */
#define IFX_PSI5_FDR_STEP_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5_FDR_Bits.STEP */
#define IFX_PSI5_FDR_STEP_OFF (0)

/** \\brief  Length for Ifx_PSI5_FDRH_Bits.DM */
#define IFX_PSI5_FDRH_DM_LEN (2)

/** \\brief  Mask for Ifx_PSI5_FDRH_Bits.DM */
#define IFX_PSI5_FDRH_DM_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5_FDRH_Bits.DM */
#define IFX_PSI5_FDRH_DM_OFF (14)

/** \\brief  Length for Ifx_PSI5_FDRH_Bits.RESULT */
#define IFX_PSI5_FDRH_RESULT_LEN (10)

/** \\brief  Mask for Ifx_PSI5_FDRH_Bits.RESULT */
#define IFX_PSI5_FDRH_RESULT_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5_FDRH_Bits.RESULT */
#define IFX_PSI5_FDRH_RESULT_OFF (16)

/** \\brief  Length for Ifx_PSI5_FDRH_Bits.STEP */
#define IFX_PSI5_FDRH_STEP_LEN (10)

/** \\brief  Mask for Ifx_PSI5_FDRH_Bits.STEP */
#define IFX_PSI5_FDRH_STEP_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5_FDRH_Bits.STEP */
#define IFX_PSI5_FDRH_STEP_OFF (0)

/** \\brief  Length for Ifx_PSI5_FDRL_Bits.DM */
#define IFX_PSI5_FDRL_DM_LEN (2)

/** \\brief  Mask for Ifx_PSI5_FDRL_Bits.DM */
#define IFX_PSI5_FDRL_DM_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5_FDRL_Bits.DM */
#define IFX_PSI5_FDRL_DM_OFF (14)

/** \\brief  Length for Ifx_PSI5_FDRL_Bits.RESULT */
#define IFX_PSI5_FDRL_RESULT_LEN (10)

/** \\brief  Mask for Ifx_PSI5_FDRL_Bits.RESULT */
#define IFX_PSI5_FDRL_RESULT_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5_FDRL_Bits.RESULT */
#define IFX_PSI5_FDRL_RESULT_OFF (16)

/** \\brief  Length for Ifx_PSI5_FDRL_Bits.STEP */
#define IFX_PSI5_FDRL_STEP_LEN (10)

/** \\brief  Mask for Ifx_PSI5_FDRL_Bits.STEP */
#define IFX_PSI5_FDRL_STEP_MSK (0x3ff)

/** \\brief  Offset for Ifx_PSI5_FDRL_Bits.STEP */
#define IFX_PSI5_FDRL_STEP_OFF (0)

/** \\brief  Length for Ifx_PSI5_FDRT_Bits.DM */
#define IFX_PSI5_FDRT_DM_LEN (2)

/** \\brief  Mask for Ifx_PSI5_FDRT_Bits.DM */
#define IFX_PSI5_FDRT_DM_MSK (0x3)

/** \\brief  Offset for Ifx_PSI5_FDRT_Bits.DM */
#define IFX_PSI5_FDRT_DM_OFF (14)

/** \\brief  Length for Ifx_PSI5_FDRT_Bits.ECEA */
#define IFX_PSI5_FDRT_ECEA_LEN (1)

