HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_INP_Bits.ERRI */
#define IFX_PSI5_INP_ERRI_LEN (4)

/** \\brief  Mask for Ifx_PSI5_INP_Bits.ERRI */
#define IFX_PSI5_INP_ERRI_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5_INP_Bits.ERRI */
#define IFX_PSI5_INP_ERRI_OFF (20)

/** \\brief  Length for Ifx_PSI5_INP_Bits.FWI */
#define IFX_PSI5_INP_FWI_LEN (4)

/** \\brief  Mask for Ifx_PSI5_INP_Bits.FWI */
#define IFX_PSI5_INP_FWI_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5_INP_Bits.FWI */
#define IFX_PSI5_INP_FWI_OFF (28)

/** \\brief  Length for Ifx_PSI5_INP_Bits.RBI */
#define IFX_PSI5_INP_RBI_LEN (4)

/** \\brief  Mask for Ifx_PSI5_INP_Bits.RBI */
#define IFX_PSI5_INP_RBI_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5_INP_Bits.RBI */
#define IFX_PSI5_INP_RBI_OFF (8)

/** \\brief  Length for Ifx_PSI5_INP_Bits.RDI */
#define IFX_PSI5_INP_RDI_LEN (4)

/** \\brief  Mask for Ifx_PSI5_INP_Bits.RDI */
#define IFX_PSI5_INP_RDI_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5_INP_Bits.RDI */
#define IFX_PSI5_INP_RDI_OFF (4)

/** \\brief  Length for Ifx_PSI5_INP_Bits.RSI */
#define IFX_PSI5_INP_RSI_LEN (4)

/** \\brief  Mask for Ifx_PSI5_INP_Bits.RSI */
#define IFX_PSI5_INP_RSI_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5_INP_Bits.RSI */
#define IFX_PSI5_INP_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5_INP_Bits.SDI */
#define IFX_PSI5_INP_SDI_LEN (4)

/** \\brief  Mask for Ifx_PSI5_INP_Bits.SDI */
#define IFX_PSI5_INP_SDI_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5_INP_Bits.SDI */
#define IFX_PSI5_INP_SDI_OFF (24)

/** \\brief  Length for Ifx_PSI5_INP_Bits.TBI */
#define IFX_PSI5_INP_TBI_LEN (4)

/** \\brief  Mask for Ifx_PSI5_INP_Bits.TBI */
#define IFX_PSI5_INP_TBI_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5_INP_Bits.TBI */
#define IFX_PSI5_INP_TBI_OFF (16)

/** \\brief  Length for Ifx_PSI5_INP_Bits.TDI */
#define IFX_PSI5_INP_TDI_LEN (4)

/** \\brief  Mask for Ifx_PSI5_INP_Bits.TDI */
#define IFX_PSI5_INP_TDI_MSK (0xf)

/** \\brief  Offset for Ifx_PSI5_INP_Bits.TDI */
#define IFX_PSI5_INP_TDI_OFF (12)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.CRCI */
#define IFX_PSI5_INTCLRA_CRCI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.CRCI */
#define IFX_PSI5_INTCLRA_CRCI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.CRCI */
#define IFX_PSI5_INTCLRA_CRCI_OFF (6)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.FWI */
#define IFX_PSI5_INTCLRA_FWI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.FWI */
#define IFX_PSI5_INTCLRA_FWI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.FWI */
#define IFX_PSI5_INTCLRA_FWI_OFF (7)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.MEI */
#define IFX_PSI5_INTCLRA_MEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.MEI */
#define IFX_PSI5_INTCLRA_MEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.MEI */
#define IFX_PSI5_INTCLRA_MEI_OFF (5)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.NBI */
#define IFX_PSI5_INTCLRA_NBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.NBI */
#define IFX_PSI5_INTCLRA_NBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.NBI */
#define IFX_PSI5_INTCLRA_NBI_OFF (4)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.NFI */
#define IFX_PSI5_INTCLRA_NFI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.NFI */
#define IFX_PSI5_INTCLRA_NFI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.NFI */
#define IFX_PSI5_INTCLRA_NFI_OFF (16)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.RBI */
#define IFX_PSI5_INTCLRA_RBI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.RBI */
#define IFX_PSI5_INTCLRA_RBI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.RBI */
#define IFX_PSI5_INTCLRA_RBI_OFF (2)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.RDI */
#define IFX_PSI5_INTCLRA_RDI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.RDI */
#define IFX_PSI5_INTCLRA_RDI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.RDI */
#define IFX_PSI5_INTCLRA_RDI_OFF (1)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.RMI */
#define IFX_PSI5_INTCLRA_RMI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.RMI */
#define IFX_PSI5_INTCLRA_RMI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.RMI */
#define IFX_PSI5_INTCLRA_RMI_OFF (9)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.RSI */
#define IFX_PSI5_INTCLRA_RSI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.RSI */
#define IFX_PSI5_INTCLRA_RSI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.RSI */
#define IFX_PSI5_INTCLRA_RSI_OFF (0)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.RUI */
#define IFX_PSI5_INTCLRA_RUI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.RUI */
#define IFX_PSI5_INTCLRA_RUI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.RUI */
#define IFX_PSI5_INTCLRA_RUI_OFF (8)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.TEI */
#define IFX_PSI5_INTCLRA_TEI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.TEI */
#define IFX_PSI5_INTCLRA_TEI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.TEI */
#define IFX_PSI5_INTCLRA_TEI_OFF (3)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.TOI */
#define IFX_PSI5_INTCLRA_TOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.TOI */
#define IFX_PSI5_INTCLRA_TOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.TOI */
#define IFX_PSI5_INTCLRA_TOI_OFF (14)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.TOOI */
#define IFX_PSI5_INTCLRA_TOOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.TOOI */
#define IFX_PSI5_INTCLRA_TOOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.TOOI */
#define IFX_PSI5_INTCLRA_TOOI_OFF (15)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.TPI */
#define IFX_PSI5_INTCLRA_TPI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.TPI */
#define IFX_PSI5_INTCLRA_TPI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.TPI */
#define IFX_PSI5_INTCLRA_TPI_OFF (10)

/** \\brief  Length for Ifx_PSI5_INTCLRA_Bits.TPOI */
#define IFX_PSI5_INTCLRA_TPOI_LEN (1)

/** \\brief  Mask for Ifx_PSI5_INTCLRA_Bits.TPOI */
#define IFX_PSI5_INTCLRA_TPOI_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_INTCLRA_Bits.TPOI */
#define IFX_PSI5_INTCLRA_TPOI_OFF (11)

