HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPsi5_bf.h
/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI22 */
#define IFX_PSI5_MEIOV_MEI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI22 */
#define IFX_PSI5_MEIOV_MEI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI22 */
#define IFX_PSI5_MEIOV_MEI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI23 */
#define IFX_PSI5_MEIOV_MEI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI23 */
#define IFX_PSI5_MEIOV_MEI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI23 */
#define IFX_PSI5_MEIOV_MEI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI24 */
#define IFX_PSI5_MEIOV_MEI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI24 */
#define IFX_PSI5_MEIOV_MEI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI24 */
#define IFX_PSI5_MEIOV_MEI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI25 */
#define IFX_PSI5_MEIOV_MEI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI25 */
#define IFX_PSI5_MEIOV_MEI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI25 */
#define IFX_PSI5_MEIOV_MEI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI26 */
#define IFX_PSI5_MEIOV_MEI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI26 */
#define IFX_PSI5_MEIOV_MEI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI26 */
#define IFX_PSI5_MEIOV_MEI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI27 */
#define IFX_PSI5_MEIOV_MEI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI27 */
#define IFX_PSI5_MEIOV_MEI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI27 */
#define IFX_PSI5_MEIOV_MEI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI28 */
#define IFX_PSI5_MEIOV_MEI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI28 */
#define IFX_PSI5_MEIOV_MEI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI28 */
#define IFX_PSI5_MEIOV_MEI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI29 */
#define IFX_PSI5_MEIOV_MEI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI29 */
#define IFX_PSI5_MEIOV_MEI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI29 */
#define IFX_PSI5_MEIOV_MEI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI2 */
#define IFX_PSI5_MEIOV_MEI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI2 */
#define IFX_PSI5_MEIOV_MEI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI2 */
#define IFX_PSI5_MEIOV_MEI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI30 */
#define IFX_PSI5_MEIOV_MEI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI30 */
#define IFX_PSI5_MEIOV_MEI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI30 */
#define IFX_PSI5_MEIOV_MEI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI31 */
#define IFX_PSI5_MEIOV_MEI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI31 */
#define IFX_PSI5_MEIOV_MEI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI31 */
#define IFX_PSI5_MEIOV_MEI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI3 */
#define IFX_PSI5_MEIOV_MEI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI3 */
#define IFX_PSI5_MEIOV_MEI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI3 */
#define IFX_PSI5_MEIOV_MEI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI4 */
#define IFX_PSI5_MEIOV_MEI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI4 */
#define IFX_PSI5_MEIOV_MEI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI4 */
#define IFX_PSI5_MEIOV_MEI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI5 */
#define IFX_PSI5_MEIOV_MEI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI5 */
#define IFX_PSI5_MEIOV_MEI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI5 */
#define IFX_PSI5_MEIOV_MEI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI6 */
#define IFX_PSI5_MEIOV_MEI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI6 */
#define IFX_PSI5_MEIOV_MEI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI6 */
#define IFX_PSI5_MEIOV_MEI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI7 */
#define IFX_PSI5_MEIOV_MEI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI7 */
#define IFX_PSI5_MEIOV_MEI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI7 */
#define IFX_PSI5_MEIOV_MEI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI8 */
#define IFX_PSI5_MEIOV_MEI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI8 */
#define IFX_PSI5_MEIOV_MEI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI8 */
#define IFX_PSI5_MEIOV_MEI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_MEIOV_Bits.MEI9 */
#define IFX_PSI5_MEIOV_MEI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEIOV_Bits.MEI9 */
#define IFX_PSI5_MEIOV_MEI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEIOV_Bits.MEI9 */
#define IFX_PSI5_MEIOV_MEI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI0 */
#define IFX_PSI5_MEISET_MEI0_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI0 */
#define IFX_PSI5_MEISET_MEI0_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI0 */
#define IFX_PSI5_MEISET_MEI0_OFF (0)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI10 */
#define IFX_PSI5_MEISET_MEI10_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI10 */
#define IFX_PSI5_MEISET_MEI10_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI10 */
#define IFX_PSI5_MEISET_MEI10_OFF (10)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI11 */
#define IFX_PSI5_MEISET_MEI11_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI11 */
#define IFX_PSI5_MEISET_MEI11_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI11 */
#define IFX_PSI5_MEISET_MEI11_OFF (11)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI12 */
#define IFX_PSI5_MEISET_MEI12_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI12 */
#define IFX_PSI5_MEISET_MEI12_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI12 */
#define IFX_PSI5_MEISET_MEI12_OFF (12)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI13 */
#define IFX_PSI5_MEISET_MEI13_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI13 */
#define IFX_PSI5_MEISET_MEI13_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI13 */
#define IFX_PSI5_MEISET_MEI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_MSK (0x1)

