HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI14 */
#define IFX_PSI5_MEISET_MEI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI15 */
#define IFX_PSI5_MEISET_MEI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI16 */
#define IFX_PSI5_MEISET_MEI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI17 */
#define IFX_PSI5_MEISET_MEI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI18 */
#define IFX_PSI5_MEISET_MEI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI19 */
#define IFX_PSI5_MEISET_MEI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI1 */
#define IFX_PSI5_MEISET_MEI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI20 */
#define IFX_PSI5_MEISET_MEI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI21 */
#define IFX_PSI5_MEISET_MEI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI22 */
#define IFX_PSI5_MEISET_MEI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI23 */
#define IFX_PSI5_MEISET_MEI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI24 */
#define IFX_PSI5_MEISET_MEI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI25 */
#define IFX_PSI5_MEISET_MEI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI26 */
#define IFX_PSI5_MEISET_MEI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI27 */
#define IFX_PSI5_MEISET_MEI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI28 */
#define IFX_PSI5_MEISET_MEI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI29 */
#define IFX_PSI5_MEISET_MEI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI2 */
#define IFX_PSI5_MEISET_MEI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI30 */
#define IFX_PSI5_MEISET_MEI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI31 */
#define IFX_PSI5_MEISET_MEI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI3 */
#define IFX_PSI5_MEISET_MEI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_MEISET_Bits.MEI4 */
#define IFX_PSI5_MEISET_MEI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_MEISET_Bits.MEI5 */
#define IFX_PSI5_MEISET_MEI5_LEN (1)

