HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI13 */
#define IFX_PSI5_NFIOV_NFI13_OFF (13)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI14 */
#define IFX_PSI5_NFIOV_NFI14_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI14 */
#define IFX_PSI5_NFIOV_NFI14_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI14 */
#define IFX_PSI5_NFIOV_NFI14_OFF (14)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI15 */
#define IFX_PSI5_NFIOV_NFI15_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI15 */
#define IFX_PSI5_NFIOV_NFI15_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI15 */
#define IFX_PSI5_NFIOV_NFI15_OFF (15)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI16 */
#define IFX_PSI5_NFIOV_NFI16_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI16 */
#define IFX_PSI5_NFIOV_NFI16_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI16 */
#define IFX_PSI5_NFIOV_NFI16_OFF (16)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI17 */
#define IFX_PSI5_NFIOV_NFI17_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI17 */
#define IFX_PSI5_NFIOV_NFI17_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI17 */
#define IFX_PSI5_NFIOV_NFI17_OFF (17)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI18 */
#define IFX_PSI5_NFIOV_NFI18_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI18 */
#define IFX_PSI5_NFIOV_NFI18_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI18 */
#define IFX_PSI5_NFIOV_NFI18_OFF (18)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI19 */
#define IFX_PSI5_NFIOV_NFI19_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI19 */
#define IFX_PSI5_NFIOV_NFI19_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI19 */
#define IFX_PSI5_NFIOV_NFI19_OFF (19)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI1 */
#define IFX_PSI5_NFIOV_NFI1_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI1 */
#define IFX_PSI5_NFIOV_NFI1_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI1 */
#define IFX_PSI5_NFIOV_NFI1_OFF (1)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI20 */
#define IFX_PSI5_NFIOV_NFI20_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI20 */
#define IFX_PSI5_NFIOV_NFI20_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI20 */
#define IFX_PSI5_NFIOV_NFI20_OFF (20)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI21 */
#define IFX_PSI5_NFIOV_NFI21_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI21 */
#define IFX_PSI5_NFIOV_NFI21_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI21 */
#define IFX_PSI5_NFIOV_NFI21_OFF (21)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI22 */
#define IFX_PSI5_NFIOV_NFI22_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI22 */
#define IFX_PSI5_NFIOV_NFI22_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI22 */
#define IFX_PSI5_NFIOV_NFI22_OFF (22)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI23 */
#define IFX_PSI5_NFIOV_NFI23_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI23 */
#define IFX_PSI5_NFIOV_NFI23_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI23 */
#define IFX_PSI5_NFIOV_NFI23_OFF (23)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI24 */
#define IFX_PSI5_NFIOV_NFI24_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI24 */
#define IFX_PSI5_NFIOV_NFI24_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI24 */
#define IFX_PSI5_NFIOV_NFI24_OFF (24)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI25 */
#define IFX_PSI5_NFIOV_NFI25_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI25 */
#define IFX_PSI5_NFIOV_NFI25_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI25 */
#define IFX_PSI5_NFIOV_NFI25_OFF (25)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI26 */
#define IFX_PSI5_NFIOV_NFI26_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI26 */
#define IFX_PSI5_NFIOV_NFI26_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI26 */
#define IFX_PSI5_NFIOV_NFI26_OFF (26)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI27 */
#define IFX_PSI5_NFIOV_NFI27_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI27 */
#define IFX_PSI5_NFIOV_NFI27_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI27 */
#define IFX_PSI5_NFIOV_NFI27_OFF (27)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI28 */
#define IFX_PSI5_NFIOV_NFI28_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI28 */
#define IFX_PSI5_NFIOV_NFI28_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI28 */
#define IFX_PSI5_NFIOV_NFI28_OFF (28)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI29 */
#define IFX_PSI5_NFIOV_NFI29_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI29 */
#define IFX_PSI5_NFIOV_NFI29_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI29 */
#define IFX_PSI5_NFIOV_NFI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI2 */
#define IFX_PSI5_NFIOV_NFI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI2 */
#define IFX_PSI5_NFIOV_NFI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI2 */
#define IFX_PSI5_NFIOV_NFI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI30 */
#define IFX_PSI5_NFIOV_NFI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI30 */
#define IFX_PSI5_NFIOV_NFI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI30 */
#define IFX_PSI5_NFIOV_NFI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI31 */
#define IFX_PSI5_NFIOV_NFI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI31 */
#define IFX_PSI5_NFIOV_NFI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI31 */
#define IFX_PSI5_NFIOV_NFI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI3 */
#define IFX_PSI5_NFIOV_NFI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI3 */
#define IFX_PSI5_NFIOV_NFI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_NFIOV_Bits.NFI3 */
#define IFX_PSI5_NFIOV_NFI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_NFIOV_Bits.NFI4 */
#define IFX_PSI5_NFIOV_NFI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_NFIOV_Bits.NFI4 */
#define IFX_PSI5_NFIOV_NFI4_MSK (0x1)

