HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxPsi5_bf.h
/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI29 */
#define IFX_PSI5_TEISET_TEI29_OFF (29)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI2 */
#define IFX_PSI5_TEISET_TEI2_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI2 */
#define IFX_PSI5_TEISET_TEI2_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI2 */
#define IFX_PSI5_TEISET_TEI2_OFF (2)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI30 */
#define IFX_PSI5_TEISET_TEI30_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI30 */
#define IFX_PSI5_TEISET_TEI30_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI30 */
#define IFX_PSI5_TEISET_TEI30_OFF (30)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI31 */
#define IFX_PSI5_TEISET_TEI31_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI31 */
#define IFX_PSI5_TEISET_TEI31_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI31 */
#define IFX_PSI5_TEISET_TEI31_OFF (31)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI3 */
#define IFX_PSI5_TEISET_TEI3_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI3 */
#define IFX_PSI5_TEISET_TEI3_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI3 */
#define IFX_PSI5_TEISET_TEI3_OFF (3)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI4 */
#define IFX_PSI5_TEISET_TEI4_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI4 */
#define IFX_PSI5_TEISET_TEI4_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI4 */
#define IFX_PSI5_TEISET_TEI4_OFF (4)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI5 */
#define IFX_PSI5_TEISET_TEI5_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI5 */
#define IFX_PSI5_TEISET_TEI5_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI5 */
#define IFX_PSI5_TEISET_TEI5_OFF (5)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI6 */
#define IFX_PSI5_TEISET_TEI6_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI6 */
#define IFX_PSI5_TEISET_TEI6_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI6 */
#define IFX_PSI5_TEISET_TEI6_OFF (6)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI7 */
#define IFX_PSI5_TEISET_TEI7_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI7 */
#define IFX_PSI5_TEISET_TEI7_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI7 */
#define IFX_PSI5_TEISET_TEI7_OFF (7)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI8 */
#define IFX_PSI5_TEISET_TEI8_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI8 */
#define IFX_PSI5_TEISET_TEI8_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI8 */
#define IFX_PSI5_TEISET_TEI8_OFF (8)

/** \\brief  Length for Ifx_PSI5_TEISET_Bits.TEI9 */
#define IFX_PSI5_TEISET_TEI9_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TEISET_Bits.TEI9 */
#define IFX_PSI5_TEISET_TEI9_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TEISET_Bits.TEI9 */
#define IFX_PSI5_TEISET_TEI9_OFF (9)

/** \\brief  Length for Ifx_PSI5_TSR_Bits.ACLR */
#define IFX_PSI5_TSR_ACLR_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TSR_Bits.ACLR */
#define IFX_PSI5_TSR_ACLR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TSR_Bits.ACLR */
#define IFX_PSI5_TSR_ACLR_OFF (30)

/** \\brief  Length for Ifx_PSI5_TSR_Bits.CLR */
#define IFX_PSI5_TSR_CLR_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TSR_Bits.CLR */
#define IFX_PSI5_TSR_CLR_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TSR_Bits.CLR */
#define IFX_PSI5_TSR_CLR_OFF (31)

/** \\brief  Length for Ifx_PSI5_TSR_Bits.CTS */
#define IFX_PSI5_TSR_CTS_LEN (24)

/** \\brief  Mask for Ifx_PSI5_TSR_Bits.CTS */
#define IFX_PSI5_TSR_CTS_MSK (0xffffff)

/** \\brief  Offset for Ifx_PSI5_TSR_Bits.CTS */
#define IFX_PSI5_TSR_CTS_OFF (0)

/** \\brief  Length for Ifx_PSI5_TSR_Bits.ETB */
#define IFX_PSI5_TSR_ETB_LEN (3)

/** \\brief  Mask for Ifx_PSI5_TSR_Bits.ETB */
#define IFX_PSI5_TSR_ETB_MSK (0x7)

/** \\brief  Offset for Ifx_PSI5_TSR_Bits.ETB */
#define IFX_PSI5_TSR_ETB_OFF (24)

/** \\brief  Length for Ifx_PSI5_TSR_Bits.TBS */
#define IFX_PSI5_TSR_TBS_LEN (1)

/** \\brief  Mask for Ifx_PSI5_TSR_Bits.TBS */
#define IFX_PSI5_TSR_TBS_MSK (0x1)

/** \\brief  Offset for Ifx_PSI5_TSR_Bits.TBS */
#define IFX_PSI5_TSR_TBS_OFF (27)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5_BF_H */
